In [1]:
import pandas as pd
import numpy as np

In [10]:
data = {
    'Nome':['Mary', 'Anna', 'Emma', 'Elizabeth','Alice','Sarah','Margaret'],
    'Sexo':['F','F','F','F','F','F','F'],
    'Data de Nascimento': ['1990','2004','1992','2007','1997','2000','1976']
}
#Comando para criar um dataframe a partir de um dicionário
df = pd.DataFrame(data, columns=['Nome', 'Sexo', 'Data de Nascimento'])

In [22]:
df.head(7)

        Nome Sexo Data de Nascimento Naturalidade
0       Mary    F               1990   Inglaterra
1       Anna    F               2004   Inglaterra
2       Emma    F               1992   Inglaterra
3  Elizabeth    F               2007   Inglaterra
4      Alice    F               1997   Inglaterra
5      Sarah    F               2000   Inglaterra
6   Margaret    F               1976   Inglaterra

In [7]:
#Quantidade de linhas e colunas no dataFrame
df.shape

(7, 3)

In [8]:
#Descrição do index
df.index

RangeIndex(start=0, stop=7, step=1)

In [9]:
#Colunas presentes no DataFrame
df.columns

Index(['Nome', 'Sexo', 'Data de Nascimento'], dtype='object')

In [12]:
#Contagem de dados não nulos
df.count()

Nome                  7
Sexo                  7
Data de Nascimento    7
dtype: int64

In [15]:
#Criando uma nova coluna em um DataFrame
df['Naturalidade'] = 'Inglaterra'

In [23]:
df.head(7)

        Nome Sexo Data de Nascimento Naturalidade
0       Mary    F               1990   Inglaterra
1       Anna    F               2004   Inglaterra
2       Emma    F               1992   Inglaterra
3  Elizabeth    F               2007   Inglaterra
4      Alice    F               1997   Inglaterra
5      Sarah    F               2000   Inglaterra
6   Margaret    F               1976   Inglaterra

In [19]:
#Comando para renomear as colunas
#df.columns = ['coluna 1', 'coluna 2', 'coluna 3' ]

In [20]:
#Soma dos valores do dataFrame
df.sum()

Nome                            MaryAnnaEmmaElizabethAliceSarahMargaret
Sexo                                                            FFFFFFF
Data de Nascimento                         1990200419922007199720001976
Naturalidade          InglaterraInglaterraInglaterraInglaterraInglat...
dtype: object

In [21]:
#Menor valor de um dataFrame
df.min()

Nome                       Alice
Sexo                           F
Data de Nascimento          1976
Naturalidade          Inglaterra
dtype: object

In [24]:
#Maior valor de um dataFrame
df.max()

Nome                       Sarah
Sexo                           F
Data de Nascimento          2007
Naturalidade          Inglaterra
dtype: object

In [27]:
#Index do menor valor
#df.idmin()
#Index do maior valor
#df.idmax()

In [28]:
#Resumo estatístico do DataFrame, com quartis, mediana, etc.
df.describe()

         Nome Sexo Data de Nascimento Naturalidade
count       7    7                  7            7
unique      7    1                  7            1
top     Alice    F               1990   Inglaterra
freq        1    7                  1            7

In [29]:
#Média dos valores
df.mean()

Series([], dtype: float64)

In [30]:
#Mediana dos valores
df.median()

Series([], dtype: float64)

In [31]:
#Aplicando uma função que substitui a por b
df.apply(lambda x: x.replace('a', 'b'))

        Nome Sexo Data de Nascimento Naturalidade
0       Mary    F               1990   Inglaterra
1       Anna    F               2004   Inglaterra
2       Emma    F               1992   Inglaterra
3  Elizabeth    F               2007   Inglaterra
4      Alice    F               1997   Inglaterra
5      Sarah    F               2000   Inglaterra
6   Margaret    F               1976   Inglaterra

In [38]:
#Ordenando valores em ordem crescente
df.sort_values(by='Nome')

        Nome Sexo Data de Nascimento Naturalidade
4      Alice    F               1997   Inglaterra
1       Anna    F               2004   Inglaterra
3  Elizabeth    F               2007   Inglaterra
2       Emma    F               1992   Inglaterra
6   Margaret    F               1976   Inglaterra
0       Mary    F               1990   Inglaterra
5      Sarah    F               2000   Inglaterra

In [39]:
df.sort_values(by='Data de Nascimento')

        Nome Sexo Data de Nascimento Naturalidade
6   Margaret    F               1976   Inglaterra
0       Mary    F               1990   Inglaterra
2       Emma    F               1992   Inglaterra
4      Alice    F               1997   Inglaterra
5      Sarah    F               2000   Inglaterra
1       Anna    F               2004   Inglaterra
3  Elizabeth    F               2007   Inglaterra

In [40]:
#Ordenando valores em ordem descrescente
df.sort_values(by='Nome', ascending='False')

        Nome Sexo Data de Nascimento Naturalidade
4      Alice    F               1997   Inglaterra
1       Anna    F               2004   Inglaterra
3  Elizabeth    F               2007   Inglaterra
2       Emma    F               1992   Inglaterra
6   Margaret    F               1976   Inglaterra
0       Mary    F               1990   Inglaterra
5      Sarah    F               2000   Inglaterra